package koreatech.in.domain.KakaoBot;

import java.util.Calendar;
import java.util.TimeZone;

public class RegularSemester extends BusForTerm {
    private static final String[][] shuttleFromKoreatech = {
            { // 월요일
                    "09:10",
                    "11:00",
                    "14:00",
                    "15:00",
                    "16:00",
                    "16:30",
                    "17:00",
                    "19:30",
                    "21:00",
                    "22:40"
            },
            { // 화요일
                    "09:10",
                    "11:00",
                    "14:00",
                    "15:00",
                    "16:00",
                    "16:30",
                    "17:00",
                    "19:30",
                    "21:00",
                    "22:40"
            },
            { // 수요일
                    "09:10",
                    "11:00",
                    "14:00",
                    "15:00",
                    "16:00",
                    "16:30",
                    "17:00",
                    "19:30",
                    "21:00",
                    "22:40"
            },
            { // 목요일
                    "09:10",
                    "11:00",
                    "14:00",
                    "15:00",
                    "16:00",
                    "16:30",
                    "17:00",
                    "19:30",
                    "21:00",
                    "22:40"
            },
            { // 금요일
                    "09:10",
                    "11:00",
                    "14:00",
                    "14:30",
                    "15:00",
                    "16:00",
                    "16:30",
                    "17:00",
                    "19:30",
                    "21:00",
                    "22:40"
            },
            { // 토요일
                    "14:00"
            },
            { // 일요일
                    "17:00"
            }
    };

    private static final String[][] shuttleFromTerminal = {
            { // 월요일
                    "08:00",
                    "10:10",
                    "11:25",
                    "14:25",
                    "16:05",
                    "16:25",
                    "16:55",
                    "17:25",
                    "18:45",
                    "19:55",
                    "22:00"
            },
            { // 화요일
                    "08:00",
                    "10:10",
                    "11:25",
                    "14:25",
                    "16:05",
                    "16:25",
                    "16:55",
                    "17:25",
                    "18:45",
                    "19:55",
                    "22:00"
            },
            { // 수요일
                    "08:00",
                    "10:10",
                    "11:25",
                    "14:25",
                    "16:05",
                    "16:25",
                    "16:55",
                    "17:25",
                    "18:45",
                    "19:55",
                    "22:00"
            },
            { // 목요일
                    "08:00",
                    "10:10",
                    "11:25",
                    "14:25",
                    "16:05",
                    "16:25",
                    "16:55",
                    "17:25",
                    "18:45",
                    "19:55",
                    "22:00"
            },
            { // 금요일
                    "08:00",
                    "10:10",
                    "11:25",
                    "14:25",
                    "16:05",
                    "16:25",
                    "16:55",
                    "17:25",
                    "18:45",
                    "19:55",
                    "22:00"
            },
            { // 토요일
                    "14:25",
                    "18:45"
            },
            { // 일요일
                    "17:30",
                    "21:15",
                    "21:30"
            }
    };

    private static final String[][] shuttleFromStationToKoreatech = {
            { // 월요일
                    "08:05",
                    "10:15",
                    "11:30",
                    "14:30",
                    "16:10",
                    "16:30",
                    "17:00",
                    "17:30",
                    "18:50",
                    "20:00",
                    "22:05"
            },
            { // 화요일
                    "08:05",
                    "10:15",
                    "11:30",
                    "14:30",
                    "16:10",
                    "16:30",
                    "17:00",
                    "17:30",
                    "18:50",
                    "20:00",
                    "22:05"
            },
            { // 수요일
                    "08:05",
                    "10:15",
                    "11:30",
                    "14:30",
                    "16:10",
                    "16:30",
                    "17:00",
                    "17:30",
                    "18:50",
                    "20:00",
                    "22:05"
            },
            { // 목요일
                    "08:05",
                    "10:15",
                    "11:30",
                    "14:30",
                    "16:10",
                    "16:30",
                    "17:00",
                    "17:30",
                    "18:50",
                    "20:00",
                    "22:05"
            },
            { // 금요일
                    "08:05",
                    "10:15",
                    "11:30",
                    "14:30",
                    "16:10",
                    "16:30",
                    "17:00",
                    "17:30",
                    "18:50",
                    "20:00",
                    "22:05"
            },
            { // 토요일
                    "14:30",
                    "18:50"
            },
            { // 일요일
                    "17:35",
                    "21:20",
                    "21:35"
            }
    };

    private static final String[][] shuttleFromStationToTerminal = {
            { // 월요일
                    "09:30",
                    "15:20"
            },
            { // 화요일
                    "09:30",
                    "15:20"
            },
            { // 수요일
                    "09:30",
                    "15:20"
            },
            { // 목요일
                    "09:30",
                    "15:20"
            },
            { // 금요일
                    "09:30",
                    "15:20"
            },
            { // 토요일
            },
            { // 일요일
            }
    };

    @Override
    protected String[] getShuttleTimetable(String departEng, String arrivalEng) {
        TimeZone timeZone = TimeZone.getTimeZone("Asia/Seoul");
        Calendar currentTime = Calendar.getInstance(timeZone); // 오늘 일자의 Calendar 객체
        int dayType = (currentTime.get(Calendar.DAY_OF_WEEK) + 5) % 7;

        if (!departEng.equalsIgnoreCase("station")) { // 출발지가 천안역이 아니라면?
            return departEng.equalsIgnoreCase("koreatech") ? shuttleFromKoreatech[dayType] : shuttleFromTerminal[dayType];
        } else { // 천안역이라면?
            return arrivalEng.equalsIgnoreCase("koreatech") ? shuttleFromStationToKoreatech[dayType] : shuttleFromStationToTerminal[dayType];
        }
    }
}
